Autodesk.Revit.DB.Structure.RebarTrimExtendData.PostRemoveSpliceError
Call this function to post an error message if the rebar splice connection will be removed.
Since:
2018

Autodesk.Revit.DB.Structure.RebarTrimExtendData.GetAddedBarGeometry(System.Int32)
Gets the added curves that will represent the bar at index barIndex.
barIndex:
The index of the bar. Should be a number between 0 and GetNumberOfBarGeometry() - 1.
Returns:
Returns the curves that will represent the bar at index barIndex. The terminations' plane normals will be applied on these curves.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex is not in the range [ 0, GetNumberOfBarGeometry()-1 ].
Since:
2018